Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationConfigurationCorrupted Property
 It looks that the Fabrication Configuration %1!s! was corrupted, please check it at %2!s!.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationConfigurationCorrupted { get; }
Public Shared ReadOnly Property FabricationConfigurationCorrupted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationConfigurationCorrupted {
	FailureDefinitionId^ get ();
}
static member FabricationConfigurationCorrupted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace